# How do i read a tabular data file into pandas

In [1]:
import pandas as pd #    this command is used for  importing the library pandas

In [5]:
pd  # to see a short documenetation for pandas library

In [6]:
tab=pd.read_table('http://bit.ly/chiporders')    # read table from the link given

In [7]:
tab.head()  # this first 5 rows from the table

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [8]:
 tab.tail()  # the last 5 items

,order_id,quantity,item_name,choice_description,item_price
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [9]:
tab.index   # index for tab, notice that here we did not use the () we will see later why.

RangeIndex(start=0, stop=4622, step=1)

In [10]:
tab.columns  # columns  for tab

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [11]:
tab2=pd.read_table('http://bit.ly/movieusers')  # here we will have a problem because the data is not a table separated data

In [12]:
tab2.head(4)  # you can see here the problem.  So the point is to choose the correct form to download the data 
            #(read_csv, read_table,...)

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213

In [13]:
# to overcome ths problem above we will use as a separator for the data |
tab2correct=pd.read_table('http://bit.ly/movieusers',sep='|')

In [14]:
tab2correct.head(2)  # goood :) now it is beautyful  but :(  here the first rows is considered as the columns but it is not.

   1  24  M technician  85711
0  2  53  F      other  94043
1  3  23  M     writer  32067

In [15]:
# do not worry we can solve it easily 
user_name=['user_id','age','gender','occupation', 'zip_code']  # a python list that will be the columns name
user_index=['first row', 'seconde row']
tab3=pd.read_table('http://bit.ly/movieusers',sep='|',header=None,names=user_name,skiprows=5)  # skiprows to skip the rows until 5

In [18]:
tab3.head(5)

   user_id  age gender     occupation zip_code
0        6   42      M      executive    98101
1        7   57      M  administrator    91344
2        8   36      M  administrator    05201
3        9   29      M        student    01002
4       10   53      M         lawyer    90703

##### # it is all about read tabular data
    # in next files we learn how to manipulate those tabular data inshaallah :) ;)